Бух_тест/src/Catalogs/ИнформационныеСсылкиДляФорм/ИнформационныеСсылкиДляФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеСсылкиДляФорм</name>
  <predefined>
    <items>
      <name>ДомашняяСтраница</name>
      <description>Домашняя страница</description>
    </items>
    <items>
      <name>Форум</name>
      <description>Форум</description>
    </items>
  </predefined>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурацииДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурацииОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйПутьКФорме</name>
    <type>
      <types>CatalogRef.ПолныеПутиКФормам</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Бух_тест/src/CommonModules/ИнформационныйЦентрСерверПовтИсп/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Информационный центр".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает таблицу с информационными ссылками для форм
//
// Параметры:
//	ПутьКФорме - Строка - полный путь к форме.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица информационных ссылок для формы с колонками:
//		Наименование - Строка - наименование информационной ссылки
//		Адрес - Строка - внешний адрес информационной ссылки
//		Вес - Число - вес информационной ссылки
//		ДатаНачалаАктуальности - Дата - дата начала актуальности информационной ссылки
//		ДатаОкончанияАктуальности - Дата - дата окончания актуальности информационной ссылки
//		Подсказка - Строка - подсказка для информационной ссылки
//
Функция ПолучитьТаблицуИнформационныхСсылокДляФормы(ПутьКФорме) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПолныйПутьКФорме",          ПутьКФорме);
	Запрос.УстановитьПараметр("ТекущаяДата",               ТекущаяДата()); // Проектное решение БСП
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПолныеПутиКФормам.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ПутиКФормам
	|ИЗ
	|	Справочник.ПолныеПутиКФормам КАК ПолныеПутиКФормам
	|ГДЕ
	|	ПолныеПутиКФормам.ПолныйПутьКФорме ПОДОБНО &ПолныйПутьКФорме
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнформационныеСсылкиДляФорм.Наименование КАК Наименование,
	|	ИнформационныеСсылкиДляФорм.Адрес КАК Адрес,
	|	ИнформационныеСсылкиДляФорм.Вес КАК Вес,
	|	ИнформационныеСсылкиДляФорм.ДатаНачалаАктуальности КАК ДатаНачалаАктуальности,
	|	ИнформационныеСсылкиДляФорм.ДатаОкончанияАктуальности КАК ДатаОкончанияАктуальности,
	|	ИнформационныеСсылкиДляФорм.Подсказка КАК Подсказка
	|ИЗ
	|	ПутиКФормам КАК ПутиКФормам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнформационныеСсылкиДляФорм КАК ИнформационныеСсылкиДляФорм
	|		ПО ПутиКФормам.Ссылка = ИнформационныеСсылкиДляФорм.ПолныйПутьКФорме
	|ГДЕ
	|	ИнформационныеСсылкиДляФорм.ДатаНачалаАктуальности <= &ТекущаяДата
	|	И ИнформационныеСсылкиДляФорм.ДатаОкончанияАктуальности >= &ТекущаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вес УБЫВ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
